Repository: Zamods/AuVilator.Xam.Forms
Catalog: AuVilator.Xam.Forms/AuVilator.Xam.Forms/Localization/Resources.*.resx
Languages: ru_ru

# AuVilator_Welcome
source: Welcome to AuVilator.
ru_ru: Добро пожаловать в AuVilator.

# BinSizeSelectedLabelText
source: Samples
ru_ru: Образцы

# BinSizeSelectionInformationText
source: Select bin size you prefer AuVilator to process the media file. Note, Bigger the size of bin means more computation will be performed by AuVilator which makes processing slow. Smaller bin size allows to purge more silence as compared to higher size whereas higher size can result in loss of non silence signals.
ru_ru: Выберите размер корзины, который вы предпочитаете AuVilator для обработки медиафайла. Обратите внимание: чем больше размер корзины, тем больше вычислений будет выполнять AuVilator, что замедлит обработку. Меньший размер бункера позволяет очистить больше тишины по сравнению с большим размером, тогда как больший размер может привести к потере сигналов без тишины.

# BinSizeSelectionTitleText
source: Select Bin Size for Signal Analysis
ru_ru: Выберите размер ячейки для анализа сигналов

# EndAmpPosInformationText
source: Select amplitude value to identify non silent signal. Note, AuVilator uses this value to search for the ending point of non silent signal bin. Please, Keep in mind that bin size affects these value in direct relation.
ru_ru: Выберите значение амплитуды для определения немого сигнала. Обратите внимание, что AuVilator использует это значение для поиска конечной точки бункера немого сигнала. Учтите, что размер бина напрямую влияет на эти значения.

# EndAmpPosSelectionTitleText
source: Select Ending Amplitude for Signal
ru_ru: Выберите конечную амплитуду для сигнала

# FileSelectionButtonText
source: Choose Audio File
ru_ru: Выберите аудиофайл

# FileSelectionTitleText
source: Select Audio File to Purge Silence
ru_ru: Выберите аудиофайл, чтобы отключить тишину

# Gen_Error_Stack
source: Error stack:
ru_ru: Стек ошибок:

# InformationCloseButtonText
source: Close
ru_ru: Закрыть

# InformationTitleText
source: Information
ru_ru: Информация

# NoFileSelected
source: No file selected yet!
ru_ru: Файл еще не выбран!

# RunSilencerButtonText
source: Run Silencer
ru_ru: Запустить глушитель

# SelectFileInformationText
source: Select any audio or video file to process. However, AuVilator will only extract audio signals regardless of file format and return results in wav file.
ru_ru: Выберите любой аудио- или видеофайл для обработки. Однако AuVilator будет извлекать только аудиосигналы независимо от формата файла и возвращать результаты в файле wav.

# Settings_V_Language_Change_Btn
source: Change
ru_ru: изменение

# Settings_V_Language_TB
source: Language
ru_ru: Язык

# Settings_V_Main_Title
source: Settings
ru_ru: Настройки

# SilencerVM_CFF_EX_Caption
source: Wrong File Format!
ru_ru: Неверный формат файла!

# SilencerVM_CFF_EX_Text_1
source: The Selected file
ru_ru: Выбранный файл

# SilencerVM_CFF_EX_Text_2
source: is not .wav format.
ru_ru: не является форматом .wav.

# SilencerVM_CFF_EX_Text_3
source: Please reselect the file.
ru_ru: Пожалуйста, выберите файл еще раз.

# SilencerVM_LF_EX_Caption
source: Error while loading file!
ru_ru: Ошибка при загрузке файла!

# SilencerVM_LF_EX_Text
source: AuVilator failed to load the selected file.
ru_ru: AuVilator не удалось загрузить выбранный файл.

# SilencerVM_LF_MB_No_Selected_Caption
source: File Select
ru_ru: Файл не выбран!

# SilencerVM_LF_Select_Picker_Filter_All
source: All files
ru_ru: Все файлы

# SilencerVM_LF_Select_Picker_Filter_Audio
source: Audio files
ru_ru: Аудио файлы

# SilencerVM_LF_Select_Wav_Title
source: Select .wav file to process.
ru_ru: Выберите файл .wav для обработки.

# SilencerVM_SF_EX_Caption
source: Error while getting file save path or name!
ru_ru: Ошибка при получении пути или имени для сохранения файла!

# SilencerVM_SF_EX_Text
source: AuVilator failed to get provided save path or name.
ru_ru: AuVilator не удалось получить путь или имя для сохранения.

# SilencerVM_SF_MB_No_Selected_Text
source: No file path or name provided!
ru_ru: Путь к файлу или имя не указаны!

# SilencerVM_SF_Save_Picker_Title
source: Save as
ru_ru: Сохранить как

# SilencerVM_STA_EX_Caption
source: Process Failed!
ru_ru: Ошибка процесса!

# SilencerVM_STA_EX_Text
source: Something went wrong while processing the given file.
ru_ru: Что-то пошло не так при обработке данного файла.

# SilencerVM_STA_MB_Caption
source: Process Completed!
ru_ru: Процесс завершен!

# SilencerVM_STA_MB_Text
source: Your audio file successfully processed!
ru_ru: Ваш аудиофайл успешно обработан!

# Silencer_V_Cancel_Btn
source: Cancel
ru_ru: Отмена

# StartAmpPosInformationText
source: Select amplitude value to identify non silent signal. Note, AuVilator uses this value to search for the starting point of non silent signal bin. Please, Keep in mind that bin size affects these value in direct relation.
ru_ru: Выберите значение амплитуды для определения немого сигнала. Обратите внимание, что AuVilator использует это значение для поиска начальной точки бункера немолчного сигнала. Учтите, что размер бина напрямую влияет на эти значения.

# StartAmpPosSelectionTitleText
source: Select Starting Amplitude for Signal
ru_ru: Выберите начальную амплитуду сигнала

# Button_OK
source: Close
ru_ru: Отмена

# BinSizePickerText
source: Choose Bin Size
ru_ru: Выберите размер корзины

# Settings_V_Language_Change_Picker_Title
source: Choose Language
ru_ru: Выберите язык
